In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

a9 = np.arange(9).reshape(3, 3)
a12 = np.arange(12).reshape(3, 4)
a20 = np.arange(20).reshape(4, 5)

df9 = DataFrame(a9, index=list('abc'), columns=list('uvw'))
df12 = DataFrame(a12, index=list('abc'), columns=list('uvwx'))
df20 = DataFrame(a20, index=list('abcd'), columns=list('uvwxy'))

s9 = Series(np.arange(9))

In [5]:
df = pd.read_clipboard()

C:\Users\xiaoyezi\Anaconda3\lib\site-packages\pandas\io\clipboards.py:63: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  return read_table(StringIO(text), sep=sep, **kwargs)

In [22]:
df = pd.read_excel('steps_info.xlsx', sheet_name="12", names=list('abcds'))

In [25]:
df = pd.read_excel('lesson_info.xlsx', index_col='index')

In [51]:
df = pd.read_excel('steps_info.xlsx', sheet_name="22", index_col=[0], skiprows=[1,2,3])

In [52]:
df.loc['乐曲演奏']

            name  start  stop  hand
card
乐曲演奏        演奏示范    NaN   NaN   NaN
乐曲演奏    趣味识谱第一乐句    3.0   6.0   2.0
乐曲演奏    趣味练习第一乐句    3.0   6.0   2.0
乐曲演奏  趣味练习第一、二乐句    3.0  10.0   2.0
乐曲演奏    趣味识谱第三乐句   11.0  14.0   2.0
乐曲演奏    趣味练习第三乐句   11.0  14.0   2.0
乐曲演奏  趣味练习第三、四乐句   11.0  18.0   2.0
乐曲演奏        趣味竞赛    NaN   NaN   NaN

In [53]:
pd.options.display.max_rows = 10

In [60]:
df1 = pd.read_excel('steps_info.xlsx', index_col=[0])

In [58]:
df1.to_csv('1.csv', encoding='utf-8')

In [68]:
df1.to_excel('1.xlsx', na_rep='nil')

In [70]:
dates = pd.date_range('1/1/2000', periods=7)

In [71]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [72]:
s = Series(np.arange(7), index = dates)

In [74]:
s.to_csv('1.csv')

In [75]:
import lxml

In [77]:
h = pd.read_html('My Reviews _ codereview.xiaoyezi Code Review.html')

In [81]:
h = h[-1]

In [82]:
h1 = DataFrame(h.iloc[1:], columns=h.iloc[0])

In [88]:
h1 = h.iloc[1:]

In [89]:
h1.columns = h.iloc[0]

In [94]:
h2 = h[2:]

In [103]:
a = h[2]

In [111]:
h1 = h[h[2].notna()]

In [116]:
h2 = h1.iloc[1:, 2:]

In [121]:
h2.columns = h1.iloc[0][2:]

In [123]:
h = pd.read_html('My Reviews _ codereview.xiaoyezi Code Review.html')
h = h[-1]
h1 = h[h[2].notna()]
h2 = h1.iloc[1:, 2:]
h2.columns = h1.iloc[0][2:]

In [124]:
h2

,Subject,Status,Owner,Project,Branch,Updated,Size,CR
6,MC-704: [fix] get play button by name,Merged,gaozeting,music_center,master,10:52 AM,NaN,NaN
7,MC-666: [fix] update font color,Merged,gaozeting,music_center,master,May 24,NaN,NaN
8,MC-670: [fix] close rank view by visible false,Merged,gaozeting,music_center,master,May 22,NaN,NaN
9,MC-670: [fix] show rank when click next in las...,Merged,gaozeting,music_center,master,May 22,NaN,NaN
10,MC-665: [fix] use callback replace opcode.,Merged,tanxinwen,music_center,master,May 21,NaN,NaN
11,KG-160: [fix] fix code error.,Merged,tanxinwen,classroom,kindergarten,May 21,NaN,NaN
12,KG-160: [feature] delete map button in SelectS...,Merged,tanxinwen,classroom,kindergarten,May 20,NaN,NaN
13,-: [fix] add kindergarten for kindergarten pac...,Merged,tanxinwen,classroom,kindergarten,May 20,NaN,NaN
14,-: [fix] fix wrong time.,Merged,tanxinwen,music_center,master,May 20,NaN,NaN
15,MC-662: [fix] cancel download work when exit.,Merged,tanxinwen,music_center,master,May 20,NaN,NaN

In [128]:
h = pd.read_html('examples/fdic_failed_bank_list.html')
h = h[0]

In [129]:
times = pd.to_datetime(h['Closing Date'])

In [133]:
times.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [135]:
h2.to_pickle('1.pickle')

In [136]:
h3 = pd.read_pickle('1.pickle')

In [145]:
df = DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('myData.h5')
store['obj1'] = df
store['obj1_col'] = df['a']

In [150]:
store.put('obj2', df, format='table')

In [155]:
store.select('obj2', where = ['index >= 10 and index <= 15'])

           a
10 -0.790511
11  0.204973
12 -0.461982
13 -0.215651
14 -0.244060
15 -0.698333

In [156]:
store.close()

In [159]:
store = pd.HDFStore('myData.h5')

In [160]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: myData.h5

In [162]:
df.to_hdf('df.h5', 'obj3', format='table')

In [165]:
pd.read_hdf('df.h5', 'obj3', where = ['index<5'])

          a
0 -0.885964
1  0.410073
2  0.617803
3  0.925692
4  0.012590

In [166]:
ex = pd.read_excel('examples/steps_info.xlsx', sheet_name=['1', '2'])

In [173]:
import sqlite3
query = 'CREATE TABLE test(a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER);'
sq = sqlite3.connect('mydata.sqlite')
sq.execute(query)
sq.commit()

In [175]:
data = [('Atlanta', 'Georgia', 1.25, 6),('Tallahassee', 'Florida', 2.6, 3),('Sacramento', 'California', 1.7, 5)]
stat = 'INSERT INTO test VALUES(?, ?, ?, ?)'
sq.executemany(stat, data)

In [176]:
cursor = sq.execute('select * from test')
rows = cursor.fetchall()

In [177]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [178]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [179]:
DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [195]:
import sqlite3
sq = sqlite3.connect('mydata1.sqlite')

query = 'CREATE TABLE test(a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER);'
sq.execute(query)

data = [('Atlanta', 'Georgia', 1.25, 6),('Tallahassee', 'Florida', 2.6, 3),('Sacramento', 'California', 1.7, 5)]
stat = 'INSERT INTO test VALUES(?, ?, ?, ?)'
sq.executemany(stat, data)

sq.commit()
sq.close()

In [200]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5
6      Atlanta     Georgia  1.25  6
7  Tallahassee     Florida  2.60  3
8   Sacramento  California  1.70  5

In [198]:
con = sqlite3.connect('mydata1.sqlite')
cursor = con.execute('select * from test')
rows = cursor.fetchall()
con.close()
DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5